src/testsuite/sysbench/results/select_random_ranges.lua_threads128/run.perf.log
sysbench 1.1.0 (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 128
Warmup time: 10s
Report intermediate results every 20 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

Warming up for 10 seconds...

[ 20s ] thds: 128 tps: 37319.75 qps: 37319.75 (r/w/o: 37319.75/0.00/0.00) lat (ms,95%): 5.99 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 128 tps: 37703.93 qps: 37703.93 (r/w/o: 37703.93/0.00/0.00) lat (ms,95%): 5.88 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 128 tps: 37609.10 qps: 37609.10 (r/w/o: 37609.10/0.00/0.00) lat (ms,95%): 5.88 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            2256402
        write:                           0
        other:                           0
        total:                           2256402
    transactions:                        2256402 (37602.16 per sec.)
    queries:                             2256402 (37602.16 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      37602.1564
    time elapsed:                        60.0099s
    total number of events:              2256402

Latency (ms):
         min:                                    0.57
         avg:                                    3.40
         max:                                   71.54
         95th percentile:                        5.88
         sum:                              7676007.18

Threads fairness:
    events (avg/stddev):           17627.8672/4337.04
    execution time (avg/stddev):   59.9688/0.01

sysbench 1.1.0 (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 128
Warmup time: 10s
Report intermediate results every 20 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

Warming up for 10 seconds...

[ 20s ] thds: 128 tps: 37839.87 qps: 37839.87 (r/w/o: 37839.87/0.00/0.00) lat (ms,95%): 5.67 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 128 tps: 37868.53 qps: 37868.53 (r/w/o: 37868.53/0.00/0.00) lat (ms,95%): 5.67 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            2269895
        write:                           0
        other:                           0
        total:                           2269895
    transactions:                        2269895 (37837.65 per sec.)
    queries:                             2269895 (37837.65 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      37837.6536
    time elapsed:                        60.0091s
    total number of events:              2269895

Latency (ms):
         min:                                    0.82
         avg:                                    3.38
         max:                                   37.94
         95th percentile:                        5.67
         sum:                              7673729.35

Threads fairness:
    events (avg/stddev):           17733.1875/4465.10
    execution time (avg/stddev):   59.9510/0.01